#include "Pair.h"
#include "Rightangled.h"
#include <iostream>
using namespace std;
/*
* Базовый класс: Пара чисел(Pair)
* first - int; second - int;
* - Определит методы изминение полей
* - Вычисление произвидения чисел
* Создать производный класс: Прямауголный_триуголнык(Rightangled)
* - Определит метод вычисление гипотенузы
*/

int main()
{
	setlocale(LC_ALL, "ru");
	/*Pair p1;
	p1.setFirst(10);
	p1.setSecond(5);
	cout << "first: " << p1.getFirst() << "\nsecond: " << p1.getSecond() << endl;*/

	/*Pair p2(4, 8);
	cout << p2.getFirst() << " * " << p2.getSecond() << " = " << p2.product() << endl;*/

	/*Pair p3;
	cin >> p3;
	cout << p3;*/

	/*Rightangled r;
	cin >> r;
	cout << "Hypotenuses = " << r.hypotenuses();*/
}